app/views/price_records/index.html.erb

                  <div class="pt-table-prod">
                    <% if record.product.image_url.present? %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1