app/controllers/price_records_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 1
---
  def set_price_record
    @price_record = PriceRecord.where(product: Current.user.products).find(params[:id])