app/controllers/price_records_controller.rb

  def index
    @price_records = PriceRecord.all.includes(:product).order(recorded_at: :desc)
---
SELECT "price_records".* FROM "price_records" ORDER BY "price_records"."recorded_at" DESC

  def new
    @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1

  def create
    @product = Product.find(params[:product_id])
    @price_record = @product.price_records.new(price_record_params)
    @price_record.recorded_at ||= Time.current
    if @price_record.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
INSERT INTO "price_records" ("product_id", "price", "store_name", "url", "recorded_at", "notes", "created_at", "updated_at") VALUES (1, 999.99, 'Apple Store', 'https://www.amazon.com', '2026-04-20 17:35:00', '', '2026-04-20 17:36:25.657209', '2026-04-20 17:36:25.657209') RETURNING "id"