app/controllers/products_controller.rb

    scope = sort_products(scope, params[:sort])

    # The "price_asc/price_desc" sort path uses GROUP BY products.id, which
    # would make Pagy's default count(:all) return per-group counts. Override
    # with the underlying filtered product count so pagination math is right.
    count_scope = Current.user.products
    count_scope = fuzzy_search(count_scope, params[:search]) if params[:search].present?
    count_scope = count_scope.where(category: params[:category]) if params[:category].present?

    @pagy, @products = pagy(scope, count: count_scope.count, limit: 24)
---
SELECT COUNT(*) FROM "products"