app/controllers/products_controller.rb

SELECT "price_records".* FROM "price_records" WHERE "price_records"."product_id" = 1
SELECT "products".* FROM "products"
SELECT MIN("price_records"."price") FROM "price_records" WHERE "price_records"."product_id" = 1
---
  def index
    @products = Current.user.products.includes(:price_records)

SELECT "price_records".* FROM "price_records" WHERE "price_records"."product_id" = 1 ORDER BY "price_records"."recorded_at" DESC LIMIT 1
---
  def show
    @price_records = @product.price_records.order(recorded_at: :desc)

INSERT INTO "products" ("name", "category", "description", "image_url", "created_at", "updated_at") VALUES ('iphone 15 pro', 'Electronics', 'iphone', '', '2026-04-20 17:35:56.994240', '2026-04-20 17:35:56.994240') RETURNING "id"
---
  def create
    @product = Current.user.products.build(product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def set_product
    @product = Current.user.products.find(params[:id])