app/views/products/index.html.erb

SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products"
---
            <span class="pt-hero-meta-dot"></span>
            <span><strong><%= @products.size %></strong> <%= "product".pluralize(@products.size) %> tracked</span>